***Selection***

**Get item**

In [2]:
%run 2-vievingData.ipynb

In [3]:
import pandas as pd
import numpy as np

dates = pd.date_range("20240413", periods=10)
dates

df = pd.DataFrame(np.random.randn(10,4), index=dates, columns=list("ABCD"))

df2 = pd.DataFrame(
    {
        "A":1.0,
        "B":pd.Timestamp("20231010"),
        "C":pd.Series(1, index=list(range(4)), dtype="float32"),
        "D":np.array([3] * 4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"foo"
    }
)

In [4]:
df["A"]

2024-04-13    0.043978
2024-04-14    0.914080
2024-04-15    1.082128
2024-04-16   -0.538510
2024-04-17    1.698575
2024-04-18    1.205221
2024-04-19    0.069808
2024-04-20   -1.143069
2024-04-21   -0.318640
2024-04-22    0.633657
Freq: D, Name: A, dtype: float64

In [5]:
df[0:3]

                   A         B         C         D
2024-04-13  0.043978  0.199175 -1.522214  0.249645
2024-04-14  0.914080  1.179940 -1.144359  1.086856
2024-04-15  1.082128  0.910773  1.152246 -0.111666

In [6]:
df["2024-04-13":"2024-04-15"]

                   A         B         C         D
2024-04-13  0.043978  0.199175 -1.522214  0.249645
2024-04-14  0.914080  1.179940 -1.144359  1.086856
2024-04-15  1.082128  0.910773  1.152246 -0.111666

In [7]:
#Selecting a row matching a label:
df.loc[dates[0]]

A    0.043978
B    0.199175
C   -1.522214
D    0.249645
Name: 2024-04-13 00:00:00, dtype: float64

In [8]:
#Selecting all rows (:) with a select column labels:
df.loc[:,["A","B"]]

                   A         B
2024-04-13  0.043978  0.199175
2024-04-14  0.914080  1.179940
2024-04-15  1.082128  0.910773
2024-04-16 -0.538510 -0.390553
2024-04-17  1.698575  1.178336
2024-04-18  1.205221  1.394191
2024-04-19  0.069808  0.126827
2024-04-20 -1.143069 -0.740885
2024-04-21 -0.318640 -0.165790
2024-04-22  0.633657  0.933752

In [9]:
df.loc["2024-04-13":"2024-04-17",["A","B"]]

                   A         B
2024-04-13  0.043978  0.199175
2024-04-14  0.914080  1.179940
2024-04-15  1.082128  0.910773
2024-04-16 -0.538510 -0.390553
2024-04-17  1.698575  1.178336

In [10]:
df.loc[dates[0],"A"]

0.04397794978196282

In [11]:
df.at[dates[0], "A"]

0.04397794978196282

**Selection by position**

In [12]:
df.iloc[3]

A   -0.538510
B   -0.390553
C   -1.281923
D    1.790321
Name: 2024-04-16 00:00:00, dtype: float64

In [13]:
df.iloc[3:5, 0:2]

                   A         B
2024-04-16 -0.538510 -0.390553
2024-04-17  1.698575  1.178336

In [14]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2024-04-14  0.914080 -1.144359
2024-04-15  1.082128  1.152246
2024-04-17  1.698575  1.813972

In [15]:
df.iloc[1:3, :]

                   A         B         C         D
2024-04-14  0.914080  1.179940 -1.144359  1.086856
2024-04-15  1.082128  0.910773  1.152246 -0.111666

In [16]:
df.iloc[1, 1]

1.1799397002043224

In [17]:
df[df["A"] > 0]

                   A         B         C         D
2024-04-13  0.043978  0.199175 -1.522214  0.249645
2024-04-14  0.914080  1.179940 -1.144359  1.086856
2024-04-15  1.082128  0.910773  1.152246 -0.111666
2024-04-17  1.698575  1.178336  1.813972 -1.914304
2024-04-18  1.205221  1.394191  1.744567  1.448367
2024-04-19  0.069808  0.126827  3.252157 -0.930019
2024-04-22  0.633657  0.933752  0.648549  1.344584

In [18]:
df[df > 0]

                   A         B         C         D
2024-04-13  0.043978  0.199175       NaN  0.249645
2024-04-14  0.914080  1.179940       NaN  1.086856
2024-04-15  1.082128  0.910773  1.152246       NaN
2024-04-16       NaN       NaN       NaN  1.790321
2024-04-17  1.698575  1.178336  1.813972       NaN
2024-04-18  1.205221  1.394191  1.744567  1.448367
2024-04-19  0.069808  0.126827  3.252157       NaN
2024-04-20       NaN       NaN  1.766745  0.228873
2024-04-21       NaN       NaN       NaN  0.870633
2024-04-22  0.633657  0.933752  0.648549  1.344584

In [19]:
df2 = df.copy()

df2["E"] = ["one", "one", "two", "three", "four", "three","three", "four", "three","six"]

df2

                   A         B         C         D      E
2024-04-13  0.043978  0.199175 -1.522214  0.249645    one
2024-04-14  0.914080  1.179940 -1.144359  1.086856    one
2024-04-15  1.082128  0.910773  1.152246 -0.111666    two
2024-04-16 -0.538510 -0.390553 -1.281923  1.790321  three
2024-04-17  1.698575  1.178336  1.813972 -1.914304   four
2024-04-18  1.205221  1.394191  1.744567  1.448367  three
2024-04-19  0.069808  0.126827  3.252157 -0.930019  three
2024-04-20 -1.143069 -0.740885  1.766745  0.228873   four
2024-04-21 -0.318640 -0.165790 -1.513327  0.870633  three
2024-04-22  0.633657  0.933752  0.648549  1.344584    six

In [20]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2024-04-15  1.082128  0.910773  1.152246 -0.111666   two
2024-04-17  1.698575  1.178336  1.813972 -1.914304  four
2024-04-20 -1.143069 -0.740885  1.766745  0.228873  four

In [21]:
s1 = pd.Series([1,2,3,4,5,6,7,8,9,10], index=pd.date_range("20231010", periods=10))

s1

2023-10-10     1
2023-10-11     2
2023-10-12     3
2023-10-13     4
2023-10-14     5
2023-10-15     6
2023-10-16     7
2023-10-17     8
2023-10-18     9
2023-10-19    10
Freq: D, dtype: int64

In [22]:
df.at[dates[0],"A"]=0
df.at[dates[4],"B"]=0

In [23]:
df.iat[3,2]=5

In [24]:
df.loc[:,"D"]=np.array([5]*len(df))

In [25]:
df2=df.copy()
df2[df2>0] = -df2

df2

                   A         B         C    D
2024-04-13  0.000000 -0.199175 -1.522214 -5.0
2024-04-14 -0.914080 -1.179940 -1.144359 -5.0
2024-04-15 -1.082128 -0.910773 -1.152246 -5.0
2024-04-16 -0.538510 -0.390553 -5.000000 -5.0
2024-04-17 -1.698575  0.000000 -1.813972 -5.0
2024-04-18 -1.205221 -1.394191 -1.744567 -5.0
2024-04-19 -0.069808 -0.126827 -3.252157 -5.0
2024-04-20 -1.143069 -0.740885 -1.766745 -5.0
2024-04-21 -0.318640 -0.165790 -1.513327 -5.0
2024-04-22 -0.633657 -0.933752 -0.648549 -5.0